tap "homebrew/core"
tap "homebrew/dev-tools"
tap "homebrew/test-bot"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap 'github/bootstrap'
tap 'caskroom/versions'
tap "nodenv/nodenv"
tap "jenkins-x/jx"
tap "tomanthony/brews"
tap "blendle/blendle"

# languages
cask "java"
brew "go"
brew "dep"
brew "python3"
brew "scala"
brew "sbt"
brew "groovysdk"

# version managers
brew "jenv"
brew "nodenv"
brew "nodenv-package-json-engine"

# Build
brew "gradle"
brew "maven"
brew "autoconf"

# Python
brew "pyenv"
brew "pipenv"

# Version Control
brew "git"
brew "hub"

brew "openssl"
brew "zlib"
brew "heroku"
brew "imagemagick"
brew "libyaml"
brew "mas"
brew "wget"
brew "bats"

# Ruby
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "ruby"

# Typescript
brew "typescript"

# ZSH
brew "zsh"
brew "zsh-completions"

# AWS tools
brew "awscli"
brew "amazon-ecs-cli"

brew "xhyve"
cask "minikube"
brew "kubectl"
brew "kubernetes-helm"
brew "kops"
brew "azure-cli"
brew "kns"
brew "jenkins-x/jx/jx"
brew "skaffold"
brew "packer"
brew "terraform"
cask "docker"
cask "docker-toolbox"
cask "android-sdk"

cask "google-chrome"
cask "firefox"
cask "vagrant"
cask "iterm2"
brew "tomanthony/brews/itermocil"
cask "sublime-text"
cask "tunnelblick"
brew "md5sha1sum"

# Productivity
cask "flux"
cask "spectacle"
cask "alfred"
cask "keepingyouawake"
cask "postman"

# Communication
cask "zoomus"

mas "Xcode", id: 497799835
