tap "homebrew/core"
tap "homebrew/dev-tools"
tap "homebrew/test-bot"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap 'github/bootstrap'
tap 'caskroom/versions'
tap "nodenv/nodenv"

# languages
cask "java"
brew "go"
brew "python3"
brew "scala"
brew "sbt"

# version managers
brew "jenv"
brew "nodenv"
brew "nodenv-package-json-engine"

# Build
brew "gradle"
brew "maven"
brew "autoconf"

# Version Control
brew "git"
brew "hub"

brew "openssl"
brew "heroku"
brew "imagemagick"
brew "libyaml"
brew "mas"
brew "wget"

# Ruby
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "ruby"


# ZSH
brew "zsh"
brew "zsh-completions"

# AWS tools
brew "awscli"
brew "amazon-ecs-cli"

brew "xhyve"
cask "minikube"
brew "kubectl"
brew "kops"
cask 'docker'
cask 'docker-toolbox'

cask "google-chrome"
cask "firefox"
cask "vagrant"
cask "iterm2"
brew "TomAnthony/brews/itermocil"
cask "sublime-text"
cask "tunnelblick"
brew "md5sha1sum"

# Productivity
cask "flux"
cask "spectacle"
cask "alfred"
cask "keepingyouawake"

# Communication
cask "zoomus"

mas "Xcode", id: 497799835
