tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/dev-tools"
tap "homebrew/test-bot"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
cask "java"
brew "alexjs"
brew "analog"
brew "angolmois"
brew "autoconf"
brew "elasticsearch@2.4", restart_service: true, link: true
brew "git"
brew "go"
brew "openssl"
brew "python3"
brew "heroku"
brew "hub"
brew "jenv"
brew "imagemagick"
brew "dnsmasq", restart_service: true
brew "libyaml"
brew "mas"
brew "memcached", restart_service: true
brew "mongodb@3.2", restart_service: true, link: true
brew "mysql@5.6", restart_service: true, link: true
brew "nginx", restart_service: true
brew "nodenv"
brew "postgresql", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "redis", restart_service: true
brew "ruby"
brew "wget"
brew "zsh"
brew "zsh-completions"
cask "google-chrome"
cask "keepingyouawake"
cask "vagrant"
cask "zoomus"
cask "iterm2"
cask "sublime-text"
cask "tunnelblick"
cask "flux"
cask "spectacle"
cask "alfred"
cask "intellij-idea"
cask "pycharm"
mas "Xcode", id: 497799835
